{
  "_name_or_path": "microsoft/BiomedNLP-BiomedBERT-base-uncased-abstract",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "the paper is not a primary experimental study in rare disease or the study is not directly investigating the natural history of a disease",
    "1": "its primary contribution centers on observing the time course of a rare disease"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "its primary contribution centers on observing the time course of a rare disease": 1,
    "the paper is not a primary experimental study in rare disease or the study is not directly investigating the natural history of a disease": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
